# Pandas
- 구조화된 데이터 처리
- 고성능 Array 계산 라이브러리 Numpy와 통합해 '스프레드시트' 처리 기능 제공
- 인덱싱, 연산, 전처리 함수 제공

## 1. Data loading

In [1]:
import pandas as pd

data_url = "https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data"
df_data = pd.read_csv(data_url, sep="\s+", header=None)

In [2]:
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

## 2. Series
- 테이블 전체를 DataFrame이라 함
- 컬럼 하나를 'Series'라고 함
- Subclass of numpy.ndarray
- Duplicates are possible (but result in reduced functionality) 인덱스의 중복은 허용하지만 당연히 안좋음

In [3]:
from pandas import Series, DataFrame
import pandas as pd

In [4]:
list_data = [1,2,3,4,5]
example_obj = Series(data=list_data) 
example_obj # index와 data를 담고 있음

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
list_data = [1,2,3,4,5]
list_name = ["a","b","c","d","e"]
example_obj = Series(data = list_data, index=list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

#### dict로도 생성 가능

In [6]:
import numpy as np
dict_data = {"a":1, "b":2, "c":3, "d":4, "e":5}
example_obj = Series(dict_data, dtype=np.float32, name="example_data") # series 의 name 도 지정할 수 있음
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [7]:
example_obj["a"]

1.0

In [8]:
example_obj["a"] = 3.2
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

#### index, values 추출

In [9]:
example_obj.values

array([3.2, 2. , 3. , 4. , 5. ], dtype=float32)

In [10]:
example_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [11]:
# 잘 안쓰긴 하지만, 시리즈 네임 및 인덱스 네임을 바꿀 수도..
example_obj.name = "number"
example_obj.index.name = "alphabet"
example_obj

alphabet
a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: number, dtype: float32

#### index를 기준으로 series 생성

In [12]:
dict_data_1 = {"a":1, "b":2, "c":3, "d":4, "e":5}
indexes = ["a", "c", "b", "d", "e", "f", "g", "h"]
series_obj_1 = Series(dict_data_1, index=indexes)
series_obj_1

a    1.0
c    3.0
b    2.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

#### numpy에 적용되었던 연산들 적용가능
- series라고 부르지만 인덱스가 추가된 numpy에 불과하다

In [13]:
example_obj[example_obj > 2]

alphabet
a    3.2
c    3.0
d    4.0
e    5.0
Name: number, dtype: float32

In [14]:
example_obj * 2

alphabet
a     6.4
b     4.0
c     6.0
d     8.0
e    10.0
Name: number, dtype: float32

In [15]:
"b" in example_obj

True

In [16]:
example_obj.to_dict()

{'a': 3.200000047683716, 'b': 2.0, 'c': 3.0, 'd': 4.0, 'e': 5.0}

## 3. DataFrame
- 하나의 컬럼 벡터 : series
- 여러 series의 합이 DataFrame
- 각 Series 마다 서로다른 타입 가질 수 있음
- 각 row(tuple) 마다, column 마다 인덱스를 가진다

#### 간단한 생성법
- 물론 이렇게 만들일은 없다

In [17]:
raw_data = {
    'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
    'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
    'age': [42, 52, 36, 24, 73],
    'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']
}
# columns 를 전달함으로써 디폴트 순서를 제어할 수 있다
# 기존의 컬럼보다 적게 전달함으로써 선택적으로 생성할 수도 있고, 새로운 컬럼을 추가할 수도 있다.
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt']) 
df

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [18]:
df.first_name # series data 얻기

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [19]:
df["first_name"] # series data 얻기 2

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

#### loc, iloc
- row instance 를 뽑을 때
- loc : index location, 이름
- iloc : index position, index number

In [20]:
df

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [21]:
df.loc[1]

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [22]:
df.iloc[1:]

  first_name last_name  age       city debt
1      Molly  Jacobson   52  Baltimore  NaN
2       Tina       Ali   36      Miami  NaN
3       Jake    Milner   24    Douglas  NaN
4        Amy     Cooze   73     Boston  NaN

In [23]:
s = pd.Series(np.nan, index=[49,48,47,46,45,1,2,3,4,5])
s.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [24]:
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

#### column에 새로운 데이터 할당

In [25]:
df["debt"] = df.age > 40
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [26]:
values = Series(data=["M","F","F"], index=[0,1,3])
values

0    M
1    F
3    F
dtype: object

In [27]:
df["gender"] = values
df

  first_name last_name  age           city   debt gender
0      Jason    Miller   42  San Francisco   True      M
1      Molly  Jacobson   52      Baltimore   True      F
2       Tina       Ali   36          Miami  False    NaN
3       Jake    Milner   24        Douglas  False      F
4        Amy     Cooze   73         Boston   True    NaN

#### 다양한 함수

In [28]:
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True
gender                  M          F    NaN        F     NaN

In [29]:
df.values

array([['Jason', 'Miller', 42, 'San Francisco', True, 'M'],
       ['Molly', 'Jacobson', 52, 'Baltimore', True, 'F'],
       ['Tina', 'Ali', 36, 'Miami', False, nan],
       ['Jake', 'Milner', 24, 'Douglas', False, 'F'],
       ['Amy', 'Cooze', 73, 'Boston', True, nan]], dtype=object)

In [30]:
df.as_matrix()

array([['Jason', 'Miller', 42, 'San Francisco', True, 'M'],
       ['Molly', 'Jacobson', 52, 'Baltimore', True, 'F'],
       ['Tina', 'Ali', 36, 'Miami', False, nan],
       ['Jake', 'Milner', 24, 'Douglas', False, 'F'],
       ['Amy', 'Cooze', 73, 'Boston', True, nan]], dtype=object)

In [31]:
df.to_csv()

',first_name,last_name,age,city,debt,gender\n0,Jason,Miller,42,San Francisco,True,M\n1,Molly,Jacobson,52,Baltimore,True,F\n2,Tina,Ali,36,Miami,False,\n3,Jake,Milner,24,Douglas,False,F\n4,Amy,Cooze,73,Boston,True,\n'

#### 컬럼 삭제

In [32]:
del df["debt"]

In [33]:
df

  first_name last_name  age           city gender
0      Jason    Miller   42  San Francisco      M
1      Molly  Jacobson   52      Baltimore      F
2       Tina       Ali   36          Miami    NaN
3       Jake    Milner   24        Douglas      F
4        Amy     Cooze   73         Boston    NaN

#### 의미 없지만 , nested dict로 생성하기
- 인덱스까지 건들일 수

In [34]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
DataFrame(pop)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

## 4. Selection & Drop

In [35]:
!conda install --y xlrd

Solving environment: done


==> WARNING: A newer version of conda exists. <==
  current version: 4.4.10
  latest version: 4.5.4

Please update conda by running

    $ conda update -n base conda



# All requested packages already installed.

In [36]:
import numpy as np
df = pd.read_excel("excel-comp-data.xlsx")
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [37]:
df["account"].head(3)

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [38]:
df[["account", "street", "state"]].head(3)

   account                                street          state
0   211829                    34456 Sean Highway          Texas
1   320563                     1311 Alvis Tunnel  NorthCarolina
2   648336  62184 Schamberger Underpass Apt. 231           Iowa

#### Selection with index number

In [39]:
df[:3]

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000

In [40]:
df["account"][:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [41]:
df["name"][[1, 2, 0]]

1                Walter-Trantow
2    Bashirian, Kunde and Price
0    Kerluke, Koepp and Hilpert
Name: name, dtype: object

In [42]:
account_series = df["account"]
account_series[account_series < 250000]

0     211829
3     109996
4     121213
5     132971
6     145068
7     205217
8     209744
9     212303
10    214098
11    231907
12    242368
Name: account, dtype: int64

#### Index 변경
- 앞에서는 0,1,2로 자동으로 인덱스를 부여했음

In [43]:
df.index = df["account"]

In [44]:
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,,
211829,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [45]:
del df["account"]
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [46]:
df[:3]

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000

In [47]:
#df[[0,1,2]] # key error, fancy index

In [48]:
df[["name","street"]][:2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [49]:
df.loc[[211829, 320563],["name","street"]]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [50]:
df.iloc[:2, :2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [51]:
df[["name","street"]].iloc[:10]

,name,street
account,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway
320563,Walter-Trantow,1311 Alvis Tunnel
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144
121213,Bauch-Goldner,7274 Marissa Common
132971,"Williamson, Schumm and Hettinger",89403 Casimer Spring
145068,Casper LLC,340 Consuela Bridge Apt. 400
205217,Kovacek-Johnston,91971 Cronin Vista Suite 601
209744,Champlin-Morar,26739 Grant Lock
212303,Gerhold-Maggio,366 Maggio Grove Apt. 998

#### Index 재설정
- 숫자로 되어있는 인덱스가 아무래도 보기좋지

In [52]:
df.index = list(range(0, 15))
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

#### Drop
- inplace 옵션을 True로 하면 자체가 바뀌긴 해

In [53]:
df.drop(1).head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000

In [54]:
df.drop([0,1,2,3]).head()

,name,street,city,state,postal-code,Jan,Feb,Mar
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000

In [55]:
# column 이름으로 drop
df.drop("city", axis=1).head() # 1 방향으로 일일히 보면서 하나씩 삭제하나봐, 만약 0을 전달하면 해당 axis에 city가 없다고 뜸

,name,street,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000

In [56]:
df.drop(["city", "state"], axis=1).head()

,name,street,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,49681,162000,120000,35000

## 5. Dataframe Operation
- 다시 강조하면 series는 numpy의 래퍼임, 인덱스만 추가된거
- series operation은 인덱스를 기준으로 연산이 수행된다

#### Series Operation

In [57]:
s1 = Series(range(1,6), index=list("abcde"))
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [58]:
s2 = Series(range(5,11), index=list("bcedef"))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [59]:
s1.add(s2) # fill_value=0 이런식의 인자 전달하면 NaN에 데이터를 채워줌

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

In [60]:
s1 + s2

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

#### Dataframe Operation
- df는 column과 index를 모두 고려
- add, sub, div, mul ...

In [61]:
df1 = DataFrame(
    np.arange(9).reshape(3,3),
    columns=list("abc")
)
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [62]:
df2 = DataFrame(
    np.arange(16).reshape(4,4),
    columns=list("abcd")
)
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [63]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [64]:
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

#### Series + Dataframe
- 헷갈리지만, 기본적으로 그렇게 해놓은 듯
- 물론 이런 연산할 일은 거의 없다고함

In [65]:
df = DataFrame(
    np.arange(16).reshape(4,4),
    columns=list("abcd")
)
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [66]:
s = Series(np.arange(10, 14), index=list("abcd"))
s

a    10
b    11
c    12
d    13
dtype: int64

In [67]:
df + s # column을 기준으로 broadcasting

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [68]:
s2 = Series(np.arange(10,14))
s2

0    10
1    11
2    12
3    13
dtype: int64

In [69]:
df + s2 # NaN

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [70]:
df.add(s2, axis=0) # shift tab으로 default 값 확인해보기

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

## 6. Lambda, map, apply

In [71]:
f = lambda x,y: x + y
f(1,4)

5

In [72]:
(lambda x: x + 1)(5)

6

#### map function
- 함수와 sequence 데이터를 인자로 받아서 각 elem 마다 적용해줌

In [73]:
ex = range(1,6)
f = lambda x: x ** 2
list(map(f, ex))

[1, 4, 9, 16, 25]

In [74]:
f = lambda x, y: x + y
list(map(f, ex, ex))

[2, 4, 6, 8, 10]

In [75]:
list(map(lambda x: x + x, ex)) # python3 부터는 list를 써줘야 데이터 볼 수 있음

[2, 4, 6, 8, 10]

#### map for series
- lambda
- dict

In [76]:
s1 = Series(np.arange(10))
s1.head()

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [77]:
s1.map(lambda x: x**2).head()

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [78]:
# dict 를 이용한 데이터 교체 ex) 남 -> 0, 여 -> 1
z = {1: 'A', 2: 'B', 3: 'C'}
s1.map(z)

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [79]:
# 같은 위치의 데이터를 s2로 전환하는 방법도 있음 (인덱스가 같은것 끼리)
s2 = Series(np.arange(10,20))
s1.map(s2).head()

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [80]:
# 실제 example
df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [81]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [82]:
df["sex_code"] = df.sex.map({"male":0, "female":1})
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [83]:
# height 정보를 가지고 키를 대 중 소로 나눌 수도 있겠지 lambda를 이용해서

#### replace
- map 과 비슷한데
- 데이터 변환시 많이 쓰임
- dict도 되지만, 리스트(target, conversion) 전달 가능

In [84]:
df.sex.replace({"male":0, "female":1}).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [85]:
df.sex.replace(
    ["male", "female"],
    [0, 1], inplace=True
)
df.head()

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

In [86]:
del df["sex_code"]
df.head()

           earn  height  sex   race  ed  age
0  79571.299011   73.89    0  white  16   49
1  96396.988643   66.23    1  white  16   62
2  48710.666947   63.77    1  white  16   33
3  80478.096153   63.22    1  other  16   95
4  82089.345498   63.08    1  white  17   43

#### apply for dataframe
- map과 달리, series 전체(column)에 함수 적용
- apply 같은 경우 통계자료 뽑을 때 굉장히 유용

In [87]:
df_info = df[["earn", "height", "age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [94]:
df_info.apply(lambda x: x.max() - x.min()) # type -> series

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [89]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [96]:
df_info.apply(sum) # 물론 axis=1로 하면 row별로 하겠지

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [100]:
# dataframe 형태로 만들기 ★ 어렵지만 매우 유용하다고 함
def f(x):
    return Series([x.min(), x.max(), x.mean()], index=["min", "max", "mean"])
df_info.apply(f)

               earn    height        age
min      -98.580489  57.34000  22.000000
max   317949.127955  77.21000  95.000000
mean   32446.292622  66.59264  45.328499

#### applymap for dataframe
- apply, applymap은 dataframe 단위에서 많이씀
- map은 series 단위에서 많이씀 (물론 apply도 적용이 가능하지)

In [103]:
f = lambda x: -x
df_info.applymap(f).head()

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [106]:
df_info["earn"].apply(lambda x: -x).head()

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

## 7. Built in function
- sum, mean, min, max, count, median, mad, var, cumsum

In [117]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

In [118]:
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [121]:
dict(enumerate(sorted(df["race"].unique()))) # 요런식으로 해서 replace 함수를 이용하면 LabelEncoder 처럼 할 수도 
# 대략 df["race"].replace(to_replace=key, value=value) 이런 식으로 key는 바꿔야할 대상, value는 어떤 값으로 바꿀지 담고 있는 배열

{0: 'black', 1: 'hispanic', 2: 'other', 3: 'white'}

In [122]:
df.sum(axis=0) # sex, race를 숫자로 변경하면..

earn                                            4.47434e+07
height                                              91831.3
sex       malefemalefemalefemalefemalefemalefemalemalema...
race      whitewhitewhiteotherwhitewhitewhitewhitehispan...
ed                                                    18416
age                                                   62508
dtype: object

In [127]:
df.isnull().sum(axis=0) # 비어있는 값이 얼마나 많은지

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

In [126]:
df.sort_values(["age","earn"], ascending=True).head(5)

             earn  height     sex      race  ed  age
1038   -56.321979   67.81    male  hispanic  10   22
800    -27.876819   72.29    male     white  12   22
963    -25.655260   68.90    male     white  12   22
1105   988.565070   64.71  female     white  12   22
801   1000.221504   64.09  female     white  12   22

In [129]:
df[["earn","height"]].cumsum().head(5) # cummax 도 있는데 머하는거지?

            earn  height
0   79571.299011   73.89
1  175968.287654  140.12
2  224678.954602  203.89
3  305157.050754  267.11
4  387246.396253  330.19

In [130]:
df.sort_values("age", ascending=False).head()

             earn  height     sex   race  ed  age
3    80478.096153   63.22  female  other  16   95
331  39169.750135   64.79  female  white  12   95
809  42963.362005   72.94    male  white  12   95
102  39751.194030   67.14    male  white  12   93
993  32809.632677   59.61  female  other  16   92